810-pokedex/pokedex/app/controllers/pokemons_controller.rb

    def index
        @pokemons = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"

    def show
        @pokemon = Pokemon.find(params[:id])
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]